STMicroelectronics/STM32DDRFW-UTIL/DDR_Tool/Common/Inc/stm32mp_util_def.h
/**
  ******************************************************************************
  * @file    stm32mp_util_def.h
  * @author  MCD Application Team
  * @brief   Header file of util definitions.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP_UTIL_DEF_H
#define __STM32MP_UTIL_DEF_H

#define UTIL_USART1   0
#define UTIL_USART2   1
#define UTIL_USART3   2
#define UTIL_UART4    3
#define UTIL_UART5    4
#define UTIL_USART6   5
#define UTIL_UART7    6
#define UTIL_UART8    7
#define UTIL_UART9    8
#define UTIL_LPUART1  9

#define UTIL_GPIOA    0
#define UTIL_GPIOB    1
#define UTIL_GPIOC    2
#define UTIL_GPIOD    3
#define UTIL_GPIOE    4
#define UTIL_GPIOF    5
#define UTIL_GPIOG    6
#define UTIL_GPIOH    7
#define UTIL_GPIOI    8
#define UTIL_GPIOJ    9
#define UTIL_GPIOK    10
#define UTIL_GPIOZ    11

#define UTIL_I2C1     0
#define UTIL_I2C2     1
#define UTIL_I2C3     2
#define UTIL_I2C4     3
#define UTIL_I2C5     4
#define UTIL_I2C6     5
#define UTIL_I2C7     6
#define UTIL_I2C8     7

#endif /* __STM32MP_UTIL_DEF_H */
